иб/src/Catalogs/Заболевания/Заболевания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Заболевания</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>КодНСС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаразнаяСписок1</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаразнаяСписок2</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтиологияБолезни</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МерыБорьбы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПереносчикиБолезни</name>
    <attributes>
      <name>Переносчик</name>
      <type>
        <types>CatalogRef.ПереносчикиБолезней</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПоражаемыеСистемы</name>
    <attributes>
      <name>ПоражаемаяСистема</name>
      <type>
        <types>CatalogRef.ПоражаемыеСистемы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВозбудителиБолезни</name>
    <attributes>
      <name>Возбудитель</name>
      <type>
        <types>CatalogRef.Возбудители</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Литература</name>
    <attributes>
      <name>Литература</name>
      <type>
        <types>CatalogRef.Литература</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВетеринарныеМероприятия</name>
    <attributes>
      <name>ВетеринарноеМероприятие</name>
      <type>
        <types>CatalogRef.ОздоровительныеМероприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПрименениеВетПрепаратов</name>
    <attributes>
      <name>ВетеринарныйПрепарат</name>
      <type>
        <types>CatalogRef.Препараты</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоНаКг</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособПрименения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КратностьПрименения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПризнакиБолезни</name>
    <attributes>
      <name>Признак</name>
      <type>
        <types>CatalogRef.ПризнакиБолезней</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

иб/src/Catalogs/Заболевания/Forms/ФормаПодбора/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.Подбор.Отображение = ОтображениеТаблицы.Дерево;
	Элементы.Подбор.НачальноеОтображениеДерева = НачальноеОтображениеДерева.РаскрыватьВерхнийУровень;
	ВидНазначения = Параметры.ВидНазначения;
	Если ВидНазначения = "ВетеринарныеМероприятия" Тогда
		Подбор.ОсновнаяТаблица = "Справочник.ОздоровительныеМероприятия"; 
		Подбор.ТекстЗапроса =
		"ВЫБРАТЬ
		|	ВетеринарныеМероприятия.Ссылка,
		|	ВетеринарныеМероприятия.Родитель
		|ИЗ
		|	Справочник.ОздоровительныеМероприятия КАК ВетеринарныеМероприятия
		|ГДЕ
		|	ВетеринарныеМероприятия.ЭтоГруппа = ЛОЖЬ";
		Подбор.Группировка.Элементы.Очистить();
        ЭлементГруппировки = Подбор.Группировка.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
        ЭлементГруппировки.Использование = Истина;
        ЭлементГруппировки.Поле = Новый ПолеКомпоновкиДанных("Родитель");
	ИначеЕсли ВидНазначения = "ПереносчикиБолезни" Тогда
		Подбор.ОсновнаяТаблица = "Справочник.ПереносчикиБолезней";
		Подбор.ТекстЗапроса =
		"ВЫБРАТЬ
		|	ПереносчикиБолезней.Ссылка,
		|	ПереносчикиБолезней.Родитель
		|ИЗ
		|	Справочник.ПереносчикиБолезней КАК ПереносчикиБолезней
		|ГДЕ
		|	ПереносчикиБолезней.ЭтоГруппа = ЛОЖЬ";
		Подбор.Группировка.Элементы.Очистить();
        ЭлементГруппировки = Подбор.Группировка.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
        ЭлементГруппировки.Использование = Истина;
        ЭлементГруппировки.Поле = Новый ПолеКомпоновкиДанных("Родитель");
	ИначеЕсли ВидНазначения = "ПоражаемыеСистемы" Тогда
		Подбор.ОсновнаяТаблица = "Справочник.ПоражаемыеСистемы";
		Подбор.ТекстЗапроса =
		"ВЫБРАТЬ
		|	ПоражаемыеСистемы.Ссылка КАК ПоражаемыеСистемы,
		|	ПоражаемыеСистемы.Родитель
		|ИЗ
		|	Справочник.ПоражаемыеСистемы КАК ПоражаемыеСистемы
		|ГДЕ
		|	ПоражаемыеСистемы.ЭтоГруппа = ЛОЖЬ";
		Подбор.Группировка.Элементы.Очистить();
        ЭлементГруппировки = Подбор.Группировка.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
        ЭлементГруппировки.Использование = Истина;
        ЭлементГруппировки.Поле = Новый ПолеКомпоновкиДанных("Родитель");
	ИначеЕсли ВидНазначения = "ВозбудителиБолезни" Тогда
		Подбор.ОсновнаяТаблица = "Справочник.Возбудители";
		Подбор.ТекстЗапроса =
		"ВЫБРАТЬ
		|	Возбудители.Ссылка
		|ИЗ
		|	Справочник.Возбудители КАК Возбудители";
	ИначеЕсли ВидНазначения = "Литература" Тогда
		Подбор.ОсновнаяТаблица = "Справочник.Литература";
		Подбор.ТекстЗапроса =
		"ВЫБРАТЬ
		|	Литература.Ссылка,
		|	Литература.Родитель
		|ИЗ
		|	Справочник.Литература КАК Литература
		|ГДЕ
		|	Литература.ЭтоГруппа = ЛОЖЬ";
		Подбор.Группировка.Элементы.Очистить();
        ЭлементГруппировки = Подбор.Группировка.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
        ЭлементГруппировки.Использование = Истина;
        ЭлементГруппировки.Поле = Новый ПолеКомпоновкиДанных("Родитель");
	ИначеЕсли ВидНазначения = "ПризнакиБолезни" Тогда
		Подбор.ОсновнаяТаблица = "Справочник.ПризнакиБолезней";
		Подбор.ТекстЗапроса =
		"ВЫБРАТЬ
		|	ПризнакиБолезни.Ссылка,
		|	ПризнакиБолезни.Родитель
		|ИЗ
		|	Справочник.ПризнакиБолезней КАК ПризнакиБолезни
		|ГДЕ
		|	ПризнакиБолезни.ЭтоГруппа = ЛОЖЬ";
		Подбор.Группировка.Элементы.Очистить();
        ЭлементГруппировки = Подбор.Группировка.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
        ЭлементГруппировки.Использование = Истина;
        ЭлементГруппировки.Поле = Новый ПолеКомпоновкиДанных("Родитель");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НазначенияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если НЕ Элемент.ТекущиеДанные.РодительскаяГруппировкаСтроки = Неопределено тогда
	ВыбранноеНазначение = ВыбранныеЭлементы.Добавить();
	ВыбранноеНазначение.Ссылка = Элемент.ТекущиеДанные.Ссылка;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВыбранныеНазначенияПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	СтандартнаяОбработка = Ложь;
	Для Каждого НомерСтроки Из ПараметрыПеретаскивания.Значение Цикл
		СтрокаВыбора = Элементы.Подбор.ДанныеСтроки(НомерСтроки);
		Если НЕ Элементы.Подбор.ДанныеСтроки(НомерСтроки).РодительскаяГруппировкаСтроки = Неопределено тогда
		ВыбранноеНазначение = ВыбранныеЭлементы.Добавить();
		ВыбранноеНазначение.Ссылка = СтрокаВыбора.Ссылка;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаКлиенте
Процедура Перенести(Команда)
	ОповеститьОВыборе(ВыбранныеЭлементы);
 	Закрыть();
КонецПроцедуры

#КонецОбласти
